[{"date":"3/1/24","notes":"read an earth-shattering manhwa (a tree without roots) and started making notes again, also reconnected with rice and felt relieved for once"},{"date":"3/2/24","notes":"reconnected with mako from soft, talked to ollie + mahi about stuff from back then, pretty disappointing day with respect to parents"},{"date":"3/3/24","notes":"wrote JEST, went to the other side of Bangalore, rediscovered Falling Down by Oasis and jammed out to it. also took the first serious step towards arting"},{"date":"3/4/24","notes":"started watching one piece "},{"date":"3/5/24","notes":"all classes got called off, noticed a slight spike in my taekwondo kicking techniques. somewhat nailed the flying kick down"},{"date":"3/6/24","notes":"synthesised ZnO, visited IISc and had a productive time. Zenia gave us sweets (a combination of soan papdi + sewaiyan) from lucknow, and got to take videos of Banibrata sir explaining our topic to a certain extent"},{"date":"3/7/24","notes":"classes called off, boarded the train to Hyderabad"},{"date":"3/8/24","notes":"reached Hyderabad today, keyboard stopped working, finished reading No Longer Human. existential crises + anxiety galore"},{"date":"3/9/24","notes":"started rereading Demian. talked to dad about germany in detail"},{"date":"3/10/24","notes":"boarding train back to Bangalore, remade my CV"},{"date":"3/11/24","notes":"arlecchino drip marketing"},{"date":"3/12/24","notes":"very tired. i love ness"},{"date":"3/13/24","notes":"discovered Daniela Pes, also read No Love Lost Lady (liked it a lot)"},{"date":"3/14/24","notes":"wrote CUET. saw riju dada's new son in a video, very adorbs! had incredibly fluffy puris @ the exam venue canteen, the scenery on the road (tumkur road) was picturesque. busy day on twitter. also found out lisa's biomed prof is related to dad's phd mentor? "},{"date":"3/15/24","notes":"extremely boring day i dont even remember what i did"},{"date":"3/16/24","notes":"had a headache most of the day, tuned into hsr 2.1 livestream (gay). also was absolutely spent after yesterday's taekwondo sesh"},{"date":"3/17/24","notes":"ate amazing egg cod nuggets (?) today, lost my mind trying to study for semiconductors midterm"},{"date":"3/18/24","notes":"absolutely flunked semiconductors midterm"},{"date":"3/19/24","notes":"absolutely slayed laser midterm"},{"date":"3/20/24","notes":"absolutely slayed nanoscience midterm, talked to soumyadeep on ig for the first time over our extreme overlap in music tastes. binged Low tide in twilight"},{"date":"3/21/24","notes":"IELTS went incredibly good, killed it in the writing section and was nervous during the speaking part but it went surprisingly okay. REMEMBERED HOW TO DO MY CARTWHEELS TODAY !!!!! + discovered chaar diwaari, ate banger biryani @ the Lighthouse"},{"date":"3/22/24","notes":"ruined the mood @ the end of the day with JAM discussion but otherwise fine. biryani + some kind of pickled chicken preparation from Lulu "},{"date":"3/23/24","notes":"good day! OE exam went well, went to MG road, got myself little one piece posters, cute trinkets from a stationery store and keqing merch images + free coffee lattes at the One plus store. ate burger @ McD. KKR vs SRH, reconnected with harshith (nailbiting match that KKR won)"},{"date":"3/24/24","notes":"got IELTS results today, 8 on 9 !! otherwise slow day, continued reading checkmate"},{"date":"3/25/24","notes":"burnout day, discovered caroline polachek to an extent?"},{"date":"3/26/24","notes":"slow day at college, talked to shivani about a lot of things + music, tried applying for my VPD but it kept failing"},{"date":"3/27/24","notes":"spent 90% of my day tweaking my sims4 + playing it"},{"date":"3/28/24","notes":"finally applied for my VPD, dad warmed up to Germany slightly. played the HSR quest, watched (tried watching more like) the Other Side of Underneath with ammu but the subs kept getting freaked (had lots of fun on call with her)"},{"date":"3/29/24","notes":"couldnt focus at all, huge rwina-doni lore drops and drama went down"},{"date":"3/30/24","notes":"acheron came home !! started the joint study group with friends i hope it works out fine"},{"date":"3/31/24","notes":"got airi's colorfes + 3 more 4 stars? also tried the pomodoro method on disc for the first time"},{},{"date":"4/1/24","notes":"found out i have ADHD-PI and that memory loss is related to that, boring day"},{"date":"4/2/24","notes":"stayed up till 2.20 to get a fuckass An card on enprsk. tried ROSALIA's discography out for the first time"},{"date":"4/3/24","notes":"re-read BJ Alex, saw the material science equipemt at college, was pretty cool"},{"date":"4/4/24","notes":"gave pre-project presentation, lukewarm experience"},{"date":"4/5/24","notes":"discovered my distinct music affinity (some sort of folktronica + indiepop mix), started watching Ergo Proxy and it is a masterpiece"},{"date":"4/6/24","notes":"worked on my art inspo board, boring day @ taekwondo too which is saying something"},{"date":"4/7/24","notes":"went to pick mom up from the airport and she was in a wheelchair?"},{"date":"4/8/24","notes":"posted APS to delhi, did the annoying ass OP-AMP experiment but understood it this time, had a delicious pizza in honor of dad's birthday (+ chocolate/pista cornettos)"},{"date":"4/9/24","notes":"ugadi holiday, found out about hip dips?"},{"date":"4/10/24","notes":"met a beautiful kitten today, APS got rejected, found a random stranger on spotify with amazing playlists"},{"date":"4/11/24","notes":"binged on Passion throughout the day"},{"date":"4/12/24","notes":"listened to tunng + caribou's discogaphy, cleared tiktok + ig spam bookmarks out, started feeling the notion notebook out"},{"date":"4/13/24","notes":"cleared out all phone tabs + remaining tiktoks"},{"date":"4/14/24","notes":"worked on notion notebook, people on anilist pissed me off to no end"},{"date":"4/15/24","notes":"finally finishes art inspo board (looks beautiful) and witnessed an incredible rcb v srh match"},{"date":"4/16/24","notes":"mentor meeting happened (kind of fun, going to Germany really set in), found out all courses were unrestricted and that hyped me up very much, mom came back (:c) and tried watching Angel's egg except my brain was fried beyond repair"},{"date":"4/17/24","notes":"applied to both the Bonn courses successfully, discovered how potent classical music is for assignments"},{"date":"4/18/24","notes":"got an 8 on 10 for laser quiz, discovered YULLOLA (very cool person), dutta sir was photograping everyone for some reason?"},{"date":"4/19/24","notes":"whiled most of my time away on twitter (becoming active again was a big mistake), gave taylor's new album a listen"},{"date":"4/20/24","notes":"wrote a really huge review for sonny boy, started making my nanoscience model and ate the biryani from lighthouse again (it was incredible)"},{"date":"4/21/24","notes":"remade friendship quiz + worked on nanoscience project/model/assignment"},{"date":"4/22/24","notes":"cleared twitter main out although its still 690+, was extra active on twitter, ate kfc chicken wings"},{"date":"4/23/24","notes":"ended up mutualing all of imane's friend group on twitter even though i wasn't forcing it?"},{"date":"4/24/24","notes":"started reading yurimag yesterday, talked to new friends quite a bit"},{"date":"4/25/24","notes":"gave my seminar it went super well! started work on pending assignments, ate delicious fried fish"},{"date":"4/26/24","notes":"did nothing of substance except mutualing cee + crying over banana fish"},{"date":"4/27/24","notes":"listened to sage gossip + worked on assignments, existentialist depression got me @ night"},{"date":"4/28/24","notes":"powered up TS4 again, worked on assignment numericals"},{"date":"4/29/24"},{"date":"4/30/24","notes":"went to Lulu mall yesterday, had a blast with a baby there"},{},{"date":"5/1/24","notes":"ate fried fish from the neighborhood store (+ yesterday's biryani), got aventurine and worked on all manuals + assignments"},{"date":"5/2/24","notes":"last day of my bachelor's degree, drank an oreo milkshake to commemorate it, worked on my manuals  "},{"date":"5/3/24","notes":"finished swarm difficulty 4 (aventurine W), connected with a lot of mutuals on linkedin"},{"date":"5/4/24","notes":"played good pizza/great pizza a lot + lab manual work, also tweaked spotify playlists"},{"date":"5/5/24","notes":"tried studying for internals (in vain), did a complete aesthetic overhaul"},{"date":"5/6/24","notes":"flunked semiconductor internal fully, witnessed insane rains? random bird made it into our living room and caused a mini hullabaloo"},{"date":"5/7/24","notes":"aced laser internal! found out i can earn 80k per month in germany without any cuts"},{"date":"5/8/24","notes":"last day at college (real this time) (lol + sob), submitted all pending assignments and manuals [side note: listening to love dive on the ride back home with the rain pattering away at the window of the bus was pretty memorable and bittersweet]"},{"date":"5/9/24","notes":"spent most of the day rotting in bed, also revamped my anilist and it looked stunning"},{"date":"5/10/24","notes":"extremely anxiety-ridden day because of no APS email + parents finding out ICTS results (that i was never gonna make anyway but whatever)"},{"date":"5/11/24","notes":"still no signs of an APS whatsoever, got onto the train for voting @ hyderabad (not for me though #Chill)"},{"date":"5/12/24","notes":"no APS. spent time in a hopeless lull, also tweeted quite a bit? about stamps and as such"},{"date":"5/13/24","notes":"woke up with a cold, heard Nattansh was planning on going to Germany too? APS-less streak continues"},{"date":"5/14/24","notes":"watched most of higurashi on the train, ate a good breakfast/mid lunch on Vande Bharat, finally found the perfect twitter layout"},{"date":"5/15/24","notes":"exposure to a shit ton of new music, preparation for laser test, achieved good layouts all around! no APS still though"},{"date":"5/16/24","notes":"found out tommorrow wasnt actually laser but FUCKING SEMICONDUCTOR PHYSICS? anyway freaked out for a good while (10 minutes) and started studying under ADHD + time constraints, fingers crossed"},{"date":"5/17/24","notes":"somewhat slayed the test! genuinely got surprised at my retention power given the fact everything was studied in merely 3 hours this morning, given up hope on APS"},{"date":"5/18/24","notes":"ate 2 plates of spaghetti from shiv sagar, watched an incredibly nail-biting pre-semi RCB/CSK match"},{"date":"5/19/24","notes":"could not concentrate for the life of me! also rediscovered affinity for fallout shelter (before an important exam... what the heck)"},{"date":"5/20/24","notes":"flunked the test to quite an extent but at least its over and at least im through"},{"date":"5/21/24","notes":"insane semi-final win + could not concentrate on nano for the life of me, also got topaz after extremely over-the-top grinding; overall seriously polarizing day (especially over the unfairness of APS)"},{"date":"5/22/24","notes":"nano test was a quarter slay, pretty tired and irritated throughout + mom aggravated me too much"},{"date":"5/23/24","notes":"uneventful day, did practically nothing outside of reading yellowface"},{"date":"5/24/24","notes":"would've been a 4 if mom hadnt been such a bitch but yeah! final day of bachelor's degree exams, went out with manasa + shivani to the tibetan restaurant and had mokthuk with chocolate shake, talked quite a bit on the metro and browsed through random (cashmere/rock tshirt) stores"},{"date":"5/25/24","notes":"started reading blood on the tracks, rediscovered love for shin chan"},{"date":"5/26/24","notes":"watched KKR win the 2024 IPL trophy"},{"date":"5/27/24","notes":"went to Lulu mall and had the tasty middle-eastern roti (?) thing + brownie cakes, also bought a geronimo stiltonoot title! also tuned into new aespa (most of it was mid but the visuals ate)"},{"date":"5/28/24","notes":"had a milkshake at the new shake store in our area + the 7 flavor panipuri, read more of yellowface but didnt really vibe with it much, restarted yaoi journey, also got serious about the thesis for once #gomen"},{"date":"5/29/24","notes":"cleaned deep priv up and made another mini comeback to priv, was chronically online most of the day, fussed way too much over priv bio?"},{"date":"5/30/24","notes":"sort of bad day because of too much existential dread and acacdemic pressure/overall fear after visit to IISc (that bombed) but came to terms with everything eventually, studied for laser lab"},{"date":"5/31/24","notes":"slayed laser lab! slow day, extremely sleep deprived"},{},{"date":"6/1/24","notes":"boring ass day but i did eat out quite a bit (poori/milkshake from kadamba in the morning, biryani/tandoori/parathas from da hood at night)"},{"date":"6/2/24","notes":"extremely mentally taxing day due to thesis work and semiconductor lab study"},{"date":"6/3/24","notes":"semiconductor lab went extremely well! finally finished undergrad exams for good lol, a score of 4 undermined to 3 only because of me being face-to-face with my academic incompetence"},{"date":"6/4/24","notes":"last day of BSc forever! thesis presentation went well, came home and crashed in my room for 6 or 7 continuous hours, started immediately rewatching Dark to incite the scientific mood"},{"date":"6/5/24","notes":"day of much vexation because of incomptent uni staff (hod) and plagiarism checks, stayed @ hotel in kurnool + had naans with paneer butter masala"},{"date":"6/6/24","notes":"day spent in train (bound to kolkata), rediscovered the joy of clumsy ninja"},{"date":"6/7/24","notes":"watched madoka magica fully for once and absolutely loved it! #ILoveYuri (also finished higurashi  but i didnt understand any of it yet)"},{"date":"6/8/24","notes":"extremely sweltering heat + suffering from cold (per usual), wrote RKMVERI entrance test and cheesed it, ate a bussin egg-chicken roll"},{"date":"6/9/24","notes":"went to CMDA + watched IND v. PAK match (we won)"},{"date":"6/10/24","notes":"clumsy ninja grinding, watched oldboy "},{"date":"6/11/24","notes":"cramps were incredibly bad and did absolutely nothing outside of doomscrolling, got APS verification news @ long last!"},{"date":"6/12/24","notes":"very eventful (neg) day with too many people and too much stimulation despite having a cold and period cramps, rediscovered my bimonthly sims passion"},{"date":"6/13/24","notes":"literally just cc-shopped all day and helped tublu with project work"},{"date":"6/14/24","notes":"spent the day nursing an immense headache + tweaking my ts4"},{"date":"6/15/24","notes":"worked all day on tublu's project but in an AC room which made it bearable"},{"date":"6/16/24","notes":"did practically nothing all day but had this weird sense of bliss? keeping me afloat (might be the closest i've been to feeling 100% stress-free)"},{"date":"6/17/24","notes":"reached hyderabad at long last, very bad cold + devoured double trap (it was sooo good)"},{"date":"6/18/24","notes":"scratched a bunch of stuff off my to-do + made movie plan with friends... (yey/naw)"},{"date":"6/19/24","notes":"hsr new update + spent alot of time looking for layout tweaks"},{"date":"6/20/24","notes":"day of several ups and downs: went out with ammu/abhee, watched haikyuu/ate tacos/browsed crossword + zudio stuff, dined at lulu (shawarma + cake), got final results, went past older schools :("},{"date":"6/21/24","notes":"listened to xiu xiu/radiohead extended discography! also completely emptied my gallery :D"},{"date":"6/22/24","notes":"took steps on skin + exercise routines, cleared tumblr following"},{"date":"6/23/24","notes":"complete skincare + exercise routine cooked up, with just the ig stuff remaining (its so over for da world)"},{"date":"6/24/24","notes":"finished blood on the tracks... the big sad (started uploads from drive!!!!)"},{"date":"6/25/24","notes":"checked a bunch of random tasks off my to-do list but didnt really achieve much besides that"},{"date":"6/26/24","notes":"very serene day, completely put my rym page together (and revelled in my artistic eye), loved figuring new shit out from scratch! + started watching maja ma and also watched a bunch of art videos @ long last"},{"date":"6/27/24","notes":"spent my entire fucking day trying to finetune my tumblr theme"},{"date":"6/28/24","notes":"complete phone theme upheaval + discovered the swans (Hard), talked to abheeshta about a thing shes passionate about :)"},{"date":"6/29/24","notes":"spent an extremely uncomfy journey on the train with aching an back and butt but bumped it out to blood promise by swans regardless, INDIA WON THE T20 WORLD CUP!!!"},{"date":"6/30/24","notes":"cc-shopping all day + keep thinking about the prospect of july 10th/upcoming summer school"},{},{"date":"7/1/24","notes":"cleared all of my cc shopping tabs up! + spent quite a bit of time on hsr"},{"date":"7/2/24","notes":"went on an HTML deepdive for a new neocities (i feel like shit)"},{"date":"7/3/24","notes":"worked on new carrd most of the day (i keep getting the ick from it), discovered all of fka twigs' discography rest of the day"},{"date":"7/4/24","notes":"on the zenless zone zero grind most of the day + implemented minor tweaks on website, copied a rentry layout and went full coquette on all personal sites"},{"date":"7/5/24","notes":"i was accused of being a weirdo by a bunch of ex mutuals over rentries! coded new pages for website"},{"date":"7/6/24","notes":"learnt new avenues of coding while making my pages, pretty nice day in terms of learning HTML and CSS"},{"date":"7/7/24","notes":"coded, and coded some more, went on an anthropological + south asian genetic ancestry deepdive"},{"date":"7/8/24","notes":"spent the day trying to replicate gooby's neocities but that threw me off web designing as a whole (lying)"},{"date":"7/9/24","notes":"was kind of bummed out most of the day over my lack of creativity and mental block over seeing something captivatiing but still looked for ideas and inspiration all over"},{"date":"7/10/24","notes":"coding. and some more coding. found an extremely no-nonsense layout that i could build from confusion-free (luv you nonkiru)"},{"date":"7/11/24","notes":"MORE CODING!!! WEBSITE IS LOOKING GOOD RAHH (the index at least)"},{"date":"7/12/24","notes":"coded some more. as usual. the like"},{"date":"7/13/24","notes":"bought loads of books. my mom is a fucking bitch"},{"date":"7/14/24","notes":"was reading Today I'm Alice most of today (haunting book)"},{"date":"7/15/24","notes":"coded after i woke up, played a LOT of hsr, ate at swagath in the evening with the onset of cramps"},{"date":"7/16/24","notes":"bad but not-so-bad cramps + worked on main page to a great extent"},{"date":"7/17/24","notes":"coded most of the morning + ate out @ yum yum tree at night"},{"date":"7/18/24","notes":"settled into a dastardly boring routine of checking gmail, coding and checking other neocities sites out, which i think will persist for a while"},{"date":"7/19/24","notes":"coded or at least tried coding (i really was looking at several different sites for inspiration) most of the morning, spent the evening/early night eating a delicious fucking shawarma to the backdrop of coldplay's hymn for the weekend (conveniently) after buying 2 pairs of white pants and party decor as my life's first quarter dimmed to an inconsequential end"},{"date":"7/20/24","notes":"okay day, don't particularly know what to feel about it but ate out at swagath, nobody really wished me (lol), parents made me cry @ night and watched an extremely depressing movie. was still an okay day though"},{"date":"7/21/24","notes":"spent the day at amrita's, had a lot of fun! we did a lot of reminiscive activities together and it made me sad as hell icl, i'll miss her quite a bit"},{"date":"7/22/24","notes":"played alot of hsr, collected lots of site inspo, replied to birthday messages in bulk"},{"date":"7/23/24","notes":"coded all day with intermittent hsr"},{"date":"7/24/24","notes":"coded all day x2"},{"date":"7/25/24","notes":"coded a lot today also! amrita was concerned due to me falling off the grid lmao"},{"date":"7/26/24","notes":"got on the train to kolkata, i'm the happiest when i'm eating biryani or shawarma #tbh (ate it thrice over the day)"},{"date":"7/27/24","notes":"visited riju dada's son he's beyond cute :)"},{"date":"7/28/24","notes":"had a pretty rad day today lol, pupu visited + watched the shining for da first time although my cold allergies flared up yet again"},{"date":"7/29/24","notes":"coded most of today, extreme site dysmorphia from hachiwa.re, watched random movies, kinda boring day ngl"},{"date":"7/30/24","notes":"coded all day + revamped site! IM GETTING BETTER AT THIS"},{"date":"7/31/24","notes":"lowkey crazy af day because pupu visited again; it felt so weird seeing young me in him plus trying to match him with the memory of him from back when, also made me realize just how mercurial my mood can be and rethink if i even want children! started watching NOPE but was kinda bored, watched all of hello neighbor's gameplay it was lowkey nice"},{},{"date":"8/1/24","notes":"pupu stayed for another day, watched the ring and i keep getting frustrated at my impatience with people in general, did slight soul-searching"},{"date":"8/2/24","notes":"coded all day, getting swifter + finished 2 main pages, kind of scared abour my germany prospects"},{"date":"8/3/24","notes":"girl i've just been coding all day idk what to write here anymore.. maybe i should integrate this sheet into site?"},{"date":"8/4/24","notes":"coded most of the day, then visited ranga pishi @ night, had quite a feast and i ate 2 chicken legs lmao??"},{"date":"8/5/24","notes":"coded. what else would you even have expected. had a pizza at night im putting on so much fat"},{"date":"8/6/24","notes":"lollll coded all day but at least my diary page is finally here! ate a chicken roll :)"},{"date":"8/7/24","notes":"had another chicken roll tonight. coded. why is every movie i watch lately a snoozefest"},{"date":"8/8/24","notes":"had to leave early for one boring ahh snake get-together that, as i had expected, bored me outta my skull, after which we visited na(w)-pishi. not much of an extraordinary experience but i was treated to a lot of great snacks (paneer pakora, chocolate icecream etc)"},{"date":"8/9/24","notes":"met a cute kid there! + pooris for breakfast, chicken curry for lunch. was kinda boring but there were smaller joys interspersed throughout the day (ramaiah deadline extended, 1000 rupees given)"},{"date":"8/10/24","notes":"worked on desk.html's basic structure all day"},{"date":"8/11/24","notes":"went to tukun pishi's house. feastes pretty good (biryani!!! <3) and watched an entire series in one day... what boredom does to a mf"},{"date":"8/12/24","notes":"worked on desk.html all day. ate biryani again tonight!"},{"date":"8/13/24","notes":"same as yesterday but got a lot of different ideas for the rest of my site! my head was hurting LOLOL"},{"date":"8/14/24","notes":"went to puchu's house HES SOOOOO I SQUEEZED HIM COUNTLESS TIMES AND YOU CAN LITERALLY SMELL MILK + BABY POWDER OFF HIM AT ANY GIVEN TIME aggh i miss him already.. he loved being in my lap towards the end too such a cutie :( had banger food the whole day as well"},{"date":"8/15/24","notes":"spent the entire day joining fanlistings cause im jobless like that"},{"date":"8/16/24","notes":"working relentlessly on site! also ate @ dada boudi last nigth food was immaculate as always"},{"date":"8/17/24","notes":"started coding but was paralyzed most of the day because of agonizing cramps man what the hell"},{"date":"8/18/24","notes":"the morning was frankly a movie like we were supposed go to hyd by train but it got delayed by 6h, we got drenched in knee-deep drainage water after a thrilling toto ride and had to walk barefoot through sand in the middle of the city to find a hotel? anyway came home and coded!"},{"date":"8/19/24","notes":"came back to hyd.... and got rejected"},{"date":"8/20/24","notes":"spent the day moping but found out about chile! which had me excited for the rest of the day. its the short bursts of dopamine that count i suppose"},{"date":"8/21/24","notes":"discovered the joy of DTI on roblox, watched a shockingly boring bollywood movie most of the afternoon-evening"},{"date":"8/22/24","notes":"really sick all day could Not stop sneezing. worked on sitemap which took surprisingly long"},{"date":"8/23/24","notes":"had a blast at ikea! ate a lot, bought a lot, just had one heck of a time after a long depressive stint"},{"date":"8/24/24","notes":"watched rudra, kinda boring, coded @ night"},{"date":"8/25/24","notes":"random coding shit mostly, lots of uni surfing "},{"date":"8/26/24","notes":"went to Ashram spent the day with mimi shes soooooo cute!!! i babysat her wholeheartedly <3 (im so mom-coded)"},{"date":"8/27/24","notes":"coded somewhat, watched Nanno do her girlboss shit for maybe 3 or 4 hours"},{"date":"8/28/24","notes":"good amount of media consumption (1 full manhwa and a movie) + coding"},{"date":"8/29/24","notes":"got really invested into graphic designing yesterday, suffic to say still stuck on desk's layout"},{"date":"8/30/24","notes":"worked on desk.html mainly"},{"date":"8/31/24","notes":"fretted over unis (again) and coded the afternoon, then an outing in the evening where we shopped quite a bit @ star hyper and ate out at taramati"},{},{"date":"9/1/24","notes":"was dragged to ashram. boring day but not so unpleasant, applied to plenty of jobs for deepak uncle"},{"date":"9/2/24","notes":"played gpgp almost all day! was pretty nice catching up, watched a random video essay"},{"date":"9/3/24","notes":"spend the day sprucing mobile home/lock screens up. also ate amazing non-KFC fried chicken"},{"date":"9/4/24","notes":"added final touches to the home + lock screens, finally happy with how it looks! (not changing it for a really long time), rewarded myself with a girl from nowhere episode"},{"date":"9/5/24","notes":"watched bulbbul (slayed (literally)), did odd jobs and concluded the day with girl from nowhere"},{"date":"9/6/24","notes":"finally finished girl from nowhere! + made/started uploading lots of palettes for the csp bag. parents kept pestering me about sitting for competitive exams again which was a bummer :/ i really hope UChile takes me"},{"date":"9/7/24","notes":"went to ashram for ganesh puja, then came home/watched minions/slept, spent the night doing odd jobs (tasks from list) and playing gpgp"},{"date":"9/8/24","notes":"really just played gpgp all day my bad, also pored over the adhd notion template for a really long time"},{"date":"9/9/24","notes":"customized spacehey layout!"},{"date":"9/10/24","notes":"hsr update main event. got around to coding + final touches to spacehey layout, live example of hitting a tiny obstacle and it ruining my entire flow "},{"date":"9/11/24","notes":"very happy day, in part because i got the novel idea of adapting spacehey layout to neocities but mainly because of free feixiao welt and robin :] i felt like the Chosen One"},{"date":"9/12/24","notes":"started work on spacehey-modified neocities layout, built (or tried building?) feixiao and robin to an extent, also went to RBL and met a very rizzful manager? who was bengali? went to soumitra uncle's house too, his son was super cute! concluded the day with a meal at taramati"},{"date":"9/13/24","notes":"spent 80% of the day on my phone reading yaoi and playing since laptop was @ the mechanic's"},{"date":"9/14/24","notes":"didnt really do much today outside of fucking around on hsr and youtube's french vlog section"},{"date":"9/15/24","notes":"watched severance.....!"},{"date":"9/16/24","notes":"was travelling the entire day but did finish watching shiki"},{"date":"9/17/24","notes":"enjoyed iit food + got into coding again + girl who's going to be okay"},{"date":"9/18/24","notes":"pretty sick most of the day but regained my coding edge again"},{"date":"9/19/24","notes":"left iitkgp and spent the entire day on trains + totos, my sleep schedule might've been fixed for good"},{"date":"9/20/24","notes":"coded most of the day, got inspired several times and came across really good resources"},{"date":"9/21/24","notes":"went on a pijo shopping spree and eat-out with the barrackpore extended family; ngl it was pretty boring in terms of hanging out since they're all adolescent teen boys (barf) and pupu's gotten annoying but i did like talking to puchki mashi + the older siblings. also banger food LOL i'd never had a deep dish pizza or mac and cheese b4"},{"date":"9/22/24","notes":"cant believe im saying this but i had more fun today?? with the baguiati extended family?? because of the lil scrunkly of course (squeezed the living fuck out of him) and also the organized chaos was...nice and nostalgic. they're horrible people but yesterday was good (and +1000 bucks)"},{"date":"9/23/24","notes":"prsk relapse (deleted immediately though). pretty lackluster day but started watching GAP and coded"},{"date":"9/24/24","notes":"bought 2 new tops + cute bows, discovered new avenues of HTML"},{"date":"9/25/24","notes":"extremely fun day, haven't laughed so much in ages! went to kanchrapara and the childlike fantasy feel to the place has still persisted"},{"date":"9/26/24","notes":"day of prolonged goodbyes and such, also was very sick but still coded plenty"},{"date":"9/27/24","notes":"travel. finished gakkou gurashi"},{"date":"9/28/24","notes":"incessant period cramps.....work done to perfect site's aesthetic + discovered a lot of new xiu xiu music"},{"date":"9/29/24","notes":"lot of coding and super bored, dread @ future possibilities"},{"date":"9/30/24","notes":"heartbreaking day, also trashy parent day temperament-wise. idk what'll happen to me in the future"},{},{"date":"10/1/24","notes":"coded all day, prepped for travelling tomorrow (also hsr-ed)"},{"date":"10/2/24","notes":"travelled most of the day! listened to a lot of music"},{"date":"10/3/24","notes":"attended (fuckass) college for the first time in months, was a hard pill to swallow :/ on the other hand debuted in my newfound clothing style "},{"date":"10/4/24","notes":"lots of coding of course, was really sick in general (+ wuthering waves relapse but only for a bit)"},{"date":"10/5/24","notes":"ate a really large and delicious pizza for lunch and dinner yesterday"},{"date":"10/6/24","notes":"finally finished and uploaded my site's version 2! worked really hard to pull through"},{"date":"10/7/24","notes":"college sapped all energy as usual (did a pendulum experiment), really wish chile would speed up their offer letter :p"},{"date":"10/8/24","notes":"been so fucking tired lately, eyes have been itching (melatonin is a sham), barely have time to do stuff because of college"},{"date":"10/9/24","notes":"college was inconsequential but attended shashti pujo celebrations @ our local pandal!!! lots of fun!!!! i love older married bengali women btw"},{"date":"10/10/24","notes":"ate a lot of bengali staple delicacies (ghugni luchi cutlet) @ pandal, also enjoyed a bunch of bharatnatyam performances. overall OK day"},{"date":"10/11/24","notes":"absolutely trashy day because of my mother dearest. please let me move out soon"},{"date":"10/12/24","notes":"didn't do much of anything today, been trying to code with tremendous effort but i'm extremely burnt out/uninspired/anxious and nothings working out, did watch a bit of shin chan and i was happy then"},{"date":"10/13/24","notes":"forced myself to type a few lines of code, while the success was minuscule at least it set the momentum forward. bored-binged hsr and it was my lowest low in a while"},{"date":"10/14/24","notes":"new moc was ass, came out to the normies in my class + nekoweb shifting spree"},{"date":"10/15/24","notes":"it rained so much i had to go to college and call an uber to come back home immediately. really hope chile takes me btw"},{"date":"10/16/24","notes":"coded some and fucked around all day after staying home because of the rains, basically"},{"date":"10/17/24","notes":"coded all day! woohoo!"},{"date":"10/18/24","notes":"went for a full-body health check-up, very intrusive deeply disturbing process but at least im healthy on all counts. was damn near about to faint after the first stab at my hand for a blood sample"},{"date":"10/19/24","notes":"coded quite a bit, also fucked around on bluesky for the most part"},{"date":"10/20/24","notes":"coded for the most part and web-surfed when free"},{"date":"10/21/24","notes":"had to go to fuckass college again but finished the blog's barebones setup"},{"date":"10/22/24","notes":"made my way back from college with a random excuse because i just dont have it in me to sit through them anymore. please chile"},{"date":"10/23/24","notes":"went to college but couldnt get myself to sit through class so i sat in my usual haunt from 3 years back in a nostalgic repeat of class skipping and consuming an entire manhwa + 2 anime episodes. luckily for me i later found out a 2 hour class wasnt even taken"},{"date":"10/24/24","notes":"attended classes but at the cost of my mental health. lulu mall!"},{"date":"10/25/24","notes":"attended one class and came home, and although i did nothing particularly fulfilling at home i was relaxed. also met a rude bus conductor but i held my ground because i dont respect this place or its laws. go to hell"},{"date":"10/26/24","notes":"spent the day in the train. no news from chile yet but hoping it comes soon"},{"date":"10/27/24","notes":"invested most of the day into (re)downloading sims4 because i couldn't take it anymore lol"},{"date":"10/28/24","notes":"spent the day downloading the remaining cc, like 60 GB i think"},{"date":"10/29/24","notes":"played the sims 4 of course! downloaded a bunch of new cc, did some slight website adjustments too"},{"date":"10/30/24","notes":"decorated my sims room to my hearts content, made her have babies and the usual, spent the day super sick the entire time "},{"date":"10/31/24","notes":"played a ton with the baby @ ashram after we went there for kali puja, also finally finished my 2nd sim and got her married lol"},{},{"date":"11/1/24","notes":"played with ANOTHER (even smaller baby) and overall felt really fulfilled from all of my social interactions...life can be beautiful sometimes"},{"date":"11/2/24","notes":"train journey most of the day, came home + played the sims + the usual"},{"date":"11/3/24","notes":"made a new cutecore blog for aesthetic itches and sims content..it really is the little things in life. also ate out at Lulu mall and bought a really cool pair of adidas shoes :3"},{"date":"11/4/24","notes":"had to go to college and spend time there until 5 pm :("},{"date":"11/5/24","notes":"health appointment !!! met 2 really cool older bengalis also, hospital food bangs btw"},{"date":"11/6/24","notes":"just an incredibly shit day. Everything burns down around me, everything burns down"},{"date":"11/7/24","notes":"80% was spent at college. the other 20% on sims 4 mods"},{"date":"11/8/24","notes":"started watching GAP again, also got my new ID card :(((("},{"date":"11/9/24","notes":"watched GAY and spent a lot of time tweaking my sims, gonna finish 2 more outfits and work on a lookbook tomorrow"},{"date":"11/10/24","notes":"had to put in a lot of time on sim 3....contemplating making an Actual gyaru sim and taking lookbook pictures for once. also went to lulu mall again btw and watched GAY :3"},{"date":"11/11/24","notes":"lots of developments in GAY the series today. also came home early, it always feels good! ahhhh"},{"date":"11/12/24","notes":"bust of a day due to spending time until 4.30 @ college and at home, sims 4 wouldnt start At all"},{"date":"11/13/24","notes":"fucked around at the usual haunt again because i just didnt want to go to classes....im so mentally tired i cant even feel anything about any of this anymore lol. watched inside out 2 though and it made me want to be someone for maybe 3 minutes "},{"date":"11/14/24","notes":"college :( had to stay in the neighbor's room for an hour because i forgor to take my keys + mom came back and it was overall an extremely dreary day"},{"date":"11/15/24","notes":"after half a day of college got my bus pass and the rest of day was spent on...customizing a single sim outift."},{"date":"11/16/24","notes":"80% of the day was spent on ts4 as expected (finally made a gyaru sim!!!!) but also tried coding for a bit and it was a disaster in terms of attention span"},{"date":"11/17/24","notes":"ts4 go brrrrr"},{"date":"11/18/24","notes":"made a brand new cv for graphic/ux/web design, went to college of course. the waiting game starts"},{"date":"11/19/24","notes":"college till 4.30.......came home and played the sims and got lectured about my several billion micro-transactions for treats"},{"date":"11/20/24","notes":"was feeling generally depressed a tad more today and every little hindrance was amplifying it :( but did get into coding again!"},{"date":"11/21/24","notes":"college till 4.00. discovered something about my time being hindered by a lack of my birthstone and although it all feels like a scam im still buying it....i guess.....mainly watched TV and gamed tbh"},{"date":"11/22/24","notes":"watched Baadshah its so fun !!! also convinced my mom to invest in curly hair routine :]"},{"date":"11/23/24","notes":"sad as fuck but started studying for mid-terms anyway in case things go awry...looked into MEXT yet again, feels like 2021 all over"},{"date":"11/24/24","notes":"did math."},{"date":"11/25/24","notes":"wrote math exam. did classical mechanics."},{"date":"11/26/24","notes":"practically bashed my head in trying to figure out main menu overrides for ts4...scared for tomorrow also"},{"date":"11/27/24","notes":"So fucking tired but exams end tomorrow and thats something"},{"date":"11/28/24","notes":"exam finish ! no news :("},{"date":"11/29/24","notes":"been trying to forget about my now impending doom by drowning myself in sims gameplay; its working to an extent but returns when the pc turns off"},{"date":"11/30/24","notes":"^ same as yesterday. finished a good portion of my house hehe"},{},{"date":"12/1/24","notes":"waited quite literally all fucking day for ts4 to load but it gave up on me; also lulu mall + bought a my melody plushie!"},{"date":"12/2/24","notes":"day started off exceptionally bad with a cold, periods, rains and no news as expected.....everythignfeels so bleak i want to kill myself"},{"date":"12/3/24","notes":"boring ass day troubleshooting sims and visiting my shit college"},{"date":"12/4/24","notes":"hsr update! free jing yuan (+ welt) with my sunday LOL...finished everything in the update today itself though so thats a bummer"},{"date":"12/5/24","notes":"unordinary day. lots of sims troubleshooting again"},{"date":"12/6/24","notes":"just...not a good day. would rather not try untangling the depths of what i felt lol, was extremely down in the dumps"},{"date":"12/7/24","notes":"went to the Goethe institute, guess i'll be learning german for realsies. had a really tasty chocolate milk float!"},{"date":"12/8/24","notes":"been playing ts4 ever since i fixed it (yesterday) and honestly i missed it so much. i truly only feel happiest when i'm playing the sims"},{"date":"12/9/24","notes":"made a subtle comeback to twitter…thinking of hardlaunching it tomorrow? also Guddu dada's getting married 💀"},{"date":"12/10/24","notes":"stressful ass day because the macabre quality to my present existence finally materially set in and it made me spend the day depressed as usual (common occurrence lately of course). my ts4 is fucked up again :/"},{"date":"12/11/24","notes":"was a holiday since someone died! im only happiest when im away from that godforsaken place"},{"date":"12/12/24","notes":"really trash day because that stupid piece of shit math teacher pissed me the fuck off more than usual and i cried because of how angry i was but at this point im over caring about how i present myself. prepared for travelling tomorrow"},{"date":"12/13/24","notes":"travelled literally all day yesterday....in the car as well as plane. read a new cute bl manhwa and was very sick @ night"},{"date":"12/14/24","notes":"woke up sorta late and spent the rest of the day doing graphs, reading the bl manhwa from yesterday and rediscovering my love for tamino"},{"date":"12/15/24","notes":"attended wedding late into the night / visited sagnik's house in the afternoon beforehand"},{"date":"12/16/24","notes":"wedding after day......travelled back home and barely slept, kind of a melancholic mood in general because i hate my present predicament so much"},{"date":"12/17/24","notes":"outside of college, spent time at home reorganizing my main sitting area and packing away non-required books"},{"date":"12/18/24","notes":":( class till 3. got apples on the way home and fully fixed my ts4, also tried working on my notion while juggling seminar work but it didnt stick?"},{"date":"12/19/24","notes":"long ass day but at least i'll be college-free for maybe 5 days over the next weekend and week"},{"date":"12/20/24","notes":"played ts4 to my heart's content :D"},{"date":"12/21/24","notes":"did a lot of odd jobs and coded seriously for the first time in weeks. gonna code more consistently starting jan of course"},{"date":"12/22/24","notes":"worked on my archive page all evening/night. dont really remember what i did in the morning but it involved a lot of numerical surfing"},{"date":"12/23/24","notes":"it was....a good day. i guess. played with puppies, bought a book, got forced to participate in the class secret santa and had a good discussion on religion. i still dont like it here but i gotta grit my teeth and its a little more tolerable with today gone"},{"date":"12/24/24","notes":"came back from college after barely an hour and a half but FINISHED MY ARCHIVE FUCKING FINALLY !!!!! I CAN FINALLY PERFECT MY NOTION AND EMPTY EVERYTHING"},{"date":"12/25/24","notes":"went to lulu mall...didnt really do much today outside of assignments (hated every second of it)"},{"date":"12/26/24","notes":"nothingburger day. gave stupid ass present at clg, submitted assignments, updated my archive"},{"date":"12/27/24","notes":"travelled all day but more importantly switched Everything to vivaldi! i freaking love this browser its beautiful"},{"date":"12/28/24","notes":"spent my singular day @ hyderabad lazing around in bed, finishing touches to the browser + laptop and i was also sort of sickly so its okay"},{"date":"12/29/24","notes":"was in car all day, napped p good! also spent a good chunk of the day (as in after i reached home) on setting the the trolley up and im so happy :3"},{"date":"12/30/24","notes":"finished my godforsaken seminar + about to finish manual. notion and hard drive wont see me coming"},{"date":"12/31/24","notes":"uneventful day, submission of manuals + going over old experiments. continued GAY so i can start pluto. def gonna work on assignments/notion in the evening"}]